RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKL26Z4/fsl_sim_hal_MKL26Z4.h
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#if !defined(__FSL_SIM_HAL_KL26Z4_H__)
#define __FSL_SIM_HAL_KL26Z4_H__


/*!
 * @addtogroup sim_hal_kl26z4
 * @{
 */
/*! @file*/

/*******************************************************************************
 * Definitions
 ******************************************************************************/

 /*! @brief COP clock source select */
typedef enum _clock_cop_src_t
{
    kClockCopSrcLpoClk,       /*!< LPO                                          */
    kClockCopSrcAltClk,       /*!< Alternative clock, for KL26Z4 it is Bus clock. */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_cop_src_kl26z4_t;
#else
} clock_cop_src_t;
#endif

/*! @brief TPM clock source select */
typedef enum _clock_tpm_src
{
    kClockTpmSrcNone,             /*!< clock disabled */
    kClockTpmSrcPllFllSel,        /*!< clock as selected by SOPT2[PLLFLLSEL]. */
    kClockTpmSrcOsc0erClk,        /*!< OSCERCLK clock */
    kClockTpmSrcMcgIrClk          /*!< MCGIR clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_tpm_src_kl26z4_t;
#else
} clock_tpm_src_t;
#endif

/*! @brief LPTMR clock source select */
typedef enum _clock_lptmr_src_t
{
    kClockLptmrSrcMcgIrClk,      /*!< MCG out clock  */
    kClockLptmrSrcLpoClk,        /*!< LPO clock      */
    kClockLptmrSrcEr32kClk,      /*!< ERCLK32K clock */
    kClockLptmrSrcOsc0erClk,     /*!< OSCERCLK clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_lptmr_src_kl26z4_t;
#else
} clock_lptmr_src_t;
#endif

/*! @brief UART0 clock source select */
typedef enum _clock_lpsci_src
{
    kClockLpsciSrcNone,          /*!< clock disabled */
    kClockLpsciSrcPllFllSel,     /*!< clock as selected by SOPT2[PLLFLLSEL]. */
    kClockLpsciSrcOsc0erClk,     /*!< OSCERCLK clock */
    kClockLpsciSrcMcgIrClk       /*!< MCGIR clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_lpsci_src_kl26z4_t;
#else
} clock_lpsci_src_t;
#endif

#if FSL_FEATURE_SOC_USB_COUNT
/*! @brief USB clock source select */
typedef enum _clock_usbfs_src
{
    kClockUsbfsSrcExt,       /*!< USB CLKIN Clock */
    kClockUsbfsSrcPllFllSel  /*!< clock as selected by SOPT2[PLLFLLSEL] */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_usbfs_src_kl26z4_t;
#else
} clock_usbfs_src_t;
#endif
#endif// FSL_FEATURE_SOC_USB_COUNT

/*! @brief SAI clock source */
typedef enum _clock_sai_src
{
    kClockSaiSrcSysClk     = 0U,  /*!< SYSCLK     */
    kClockSaiSrcOsc0erClk  = 1U,  /*!< OSC0ERCLK  */
    kClockSaiSrcPllClk     = 3U   /*!< MCGPLLCLK  */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_sai_src_kl26z4_t;
#else
} clock_sai_src_t;
#endif

/*! @brief SIM PLLFLLSEL clock source select */
typedef enum _clock_pllfll_sel
{
    kClockPllFllSelFll,       /*!< Fll clock */
    kClockPllFllSelPll        /*!< Pll0 clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_pllfll_sel_kl26z4_t;
#else
} clock_pllfll_sel_t;
#endif

/*! @brief SIM external reference clock source select (OSC32KSEL) */
typedef enum _clock_er32k_src
{
    kClockEr32kSrcOsc0     = 0U,     /*!< OSC 32k clock */
    kClockEr32kSrcReserved = 1U,     /*!< Reserved */
    kClockEr32kSrcRtc      = 2U,     /*!< RTC 32k clock */
    kClockEr32kSrcLpo      = 3U      /*!< LPO clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_er32k_src_kl26z4_t;
#else
} clock_er32k_src_t;
#endif

/*! @brief SIM CLKOUT_SEL clock source select */
typedef enum _clock_clkout_src
{
    kClockClkoutReserved  = 0U,        /*!< Reserved */
    kClockClkoutReserved1 = 1U,        /*!< Reserved */
    kClockClkoutBusClk    = 2U,        /*!< Bus clock */
    kClockClkoutLpoClk    = 3U,        /*!< LPO clock */
    kClockClkoutMcgIrClk  = 4U,        /*!< MCG ir clock */
    kClockClkoutReserved2 = 5U,        /*!< Reserved */
    kClockClkoutOsc0erClk = 6U,        /*!< OSC0ER clock */
    kClockClkoutReserved3 = 7U         /*!< Reserved */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_clkout_src_kl26z4_t;
#else
} clock_clkout_src_t;
#endif

/*! @brief SIM RTCCLKOUTSEL clock source select */
typedef enum _clock_rtcout_src
{
    kClockRtcoutSrc1Hz,         /*!< 1Hz clock */
    kClockRtcoutSrc32kHz        /*!< 32KHz clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_rtcout_src_kl26z4_t;
#else
} clock_rtcout_src_t;
#endif

#if FSL_FEATURE_SOC_USB_COUNT
/*! @brief SIM USB voltage regulator in standby mode setting during stop modes */
typedef enum _sim_usbsstby_mode
{
    kSimUsbsstbyNoRegulator,        /*!< regulator not in standby during Stop modes */
    kSimUsbsstbyWithRegulator       /*!< regulator in standby during Stop modes */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_usbsstby_mode_kl26z4_t;
#else
} sim_usbsstby_mode_t;
#endif

/*! @brief SIM USB voltage regulator in standby mode setting during VLPR and VLPW modes */
typedef enum _sim_usbvstby_mode
{
    kSimUsbvstbyNoRegulator,        /*!< regulator not in standby during VLPR and VLPW modes */
    kSimUsbvstbyWithRegulator       /*!< regulator in standby during VLPR and VLPW modes */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_usbvstby_mode_kl26z4_t;
#else
} sim_usbvstby_mode_t;
#endif
#endif// FSL_FEATURE_SOC_USB_COUNT

